_org_posts/_posts/2021-08-22-abc215-d-upsolve.org
#+HTML: ---
#+HTML: layout: post
#+HTML: title: D - Coprime 2
#+HTML: tags: AtCoder
#+HTML: ---
#+OPTIONS: ^:nil

** D - Coprime 2
- 작성중

** 용어
- 서로소(coprime integers)
- GCD(x, y) = 1 의미는 x, y는 공약수(a common divisor)가 없다.
- 소인수분해 (prime factorization, factorization in prime factors)
- 인수분해 (factorization)
- 소인수 (prime factor)

** Prime Factorization (소인수분해)

#+BEGIN_EXAMPLE
12 = 2 x 2 x 3
#+END_EXAMPLE

** 접근하기

- GCD(x, y) = 1은 서로 소인 수를 의미함

- GCD(x, y) != 1 은 X를 소인수분해 했을 때, 배수가 있음을 의미

- 룩업 배열에 인수와 그 배수를 check해주고, 1~M까지 loop에서 남아있는 수를 고르면 된다.
#+BEGIN_EXAMPLE
a[x] = GCD(A[i], x) != 1 
#+END_EXAMPLE

** 풀이
#+BEGIN_SRC cpp
#include <iostream>
using namespace std;

#define ARR_SIZE 100010

int N, M;

int a[ARR_SIZE];
int fact[ARR_SIZE];
int fidx;

int out[ARR_SIZE];
int idx;

void pfact(int num)
{
    for(int i=2;i*i<=num;i++) {
        while(num%i==0) {
            num /= i;
            fact[fidx++] = i;
        }
    }  
    if (num != 1)
        fact[fidx++] = num;
}

int main(int argc, char* argv[])
{
    cin >> N >> M;
    for(int i=0;i<ARR_SIZE;i++) a[i] = 1;

    for(int i=0;i<N;i++) {
        int num;
        cin >> num;
       
        fidx = 0;
        pfact(num);
        for(int j=0;j<fidx;j++) {
            if(a[fact[j]]) {
                for(int k=fact[j];k<ARR_SIZE;k+=fact[j]) {
                    a[k] = 0;
                }
            }
        }
    }

    for(int i=1;i<=M;i++) {
        if (a[i]) out[idx++] = i;        
    }    
    
    cout << idx << endl;
    for(int i=0;i<idx;i++) {
        cout << out[i] << endl;
    }
    return 0;
}
#+END_SRC

** 문제 링크/참고자료
- https://atcoder.jp/contests/abc215/tasks/abc215_d
- https://blog.hamayanhamayan.com/entry/2021/08/21/233514
