_posts/2021-08-22-abc215-d-upsolve.html
---
title: D - Coprime 2
tags: AtCoder
toc: true
toc_sticky: true
---

<div id="outline-container-org73bd17a" class="outline-2">
<h2 id="org73bd17a">D - Coprime 2</h2>
<div class="outline-text-2" id="text-org73bd17a">
<ul class="org-ul">
<li>작성중</li>
</ul>
</div>
</div>

<div id="outline-container-org62d4538" class="outline-2">
<h2 id="org62d4538">용어</h2>
<div class="outline-text-2" id="text-org62d4538">
<ul class="org-ul">
<li>서로소(coprime integers)</li>
<li>GCD(x, y) = 1 의미는 x, y는 공약수(a common divisor)가 없다.</li>
<li>소인수분해 (prime factorization, factorization in prime factors)</li>
<li>인수분해 (factorization)</li>
<li>소인수 (prime factor)</li>
</ul>
</div>
</div>

<div id="outline-container-org822b66b" class="outline-2">
<h2 id="org822b66b">Prime Factorization (소인수분해)</h2>
<div class="outline-text-2" id="text-org822b66b">
<pre class="example">
12 = 2 x 2 x 3
</pre>
</div>
</div>

<div id="outline-container-orgd938d18" class="outline-2">
<h2 id="orgd938d18">접근하기</h2>
<div class="outline-text-2" id="text-orgd938d18">
<ul class="org-ul">
<li>GCD(x, y) = 1은 서로 소인 수를 의미함</li>

<li>GCD(x, y) != 1 은 X를 소인수분해 했을 때, 배수가 있음을 의미</li>

<li>룩업 배열에 인수와 그 배수를 check해주고, 1~M까지 loop에서 남아있는 수를 고르면 된다.</li>
</ul>
<pre class="example">
a[x] = GCD(A[i], x) != 1 
</pre>
</div>
</div>

<div id="outline-container-org0ad18e8" class="outline-2">
<h2 id="org0ad18e8">풀이</h2>
<div class="outline-text-2" id="text-org0ad18e8">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;iostream&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">ARR_SIZE</span> 100010

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>, <span style="color: #ff6347;">M</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[ARR_SIZE];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">fact</span>[ARR_SIZE];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">fidx</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">out</span>[ARR_SIZE];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>;

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">pfact</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>)
{
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=2;i*i&lt;=num;i++) {
        <span style="color: #729fcf; font-weight: bold;">while</span>(num%i==0) {
            num /= i;
            fact[fidx++] = i;
        }
    }  
    <span style="color: #729fcf; font-weight: bold;">if</span> (num != 1)
        fact[fidx++] = num;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    cin &gt;&gt; N &gt;&gt; M;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;ARR_SIZE;i++) a[i] = 1;

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">num</span>;
        cin &gt;&gt; num;

        fidx = 0;
        pfact(num);
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;j&lt;fidx;j++) {
            <span style="color: #729fcf; font-weight: bold;">if</span>(a[fact[j]]) {
                <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">k</span>=fact[j];k&lt;ARR_SIZE;k+=fact[j]) {
                    a[k] = 0;
                }
            }
        }
    }

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=1;i&lt;=M;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (a[i]) out[idx++] = i;        
    }    

    cout &lt;&lt; idx &lt;&lt; endl;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;idx;i++) {
        cout &lt;&lt; out[i] &lt;&lt; endl;
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga87d71b" class="outline-2">
<h2 id="orga87d71b">문제 링크/참고자료</h2>
<div class="outline-text-2" id="text-orga87d71b">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc215/tasks/abc215_d">https://atcoder.jp/contests/abc215/tasks/abc215_d</a></li>
<li><a href="https://blog.hamayanhamayan.com/entry/2021/08/21/233514">https://blog.hamayanhamayan.com/entry/2021/08/21/233514</a></li>
</ul>
</div>
</div>
